In [11]:
import pandas as pd

In [12]:
df = pd.read_csv('data.csv')

In [13]:
df

,fname,lname,age_gender,section,height(cm),weight(kg),age,spend_A,spend_B,spend_C
0,Mohammed,Ali,36_M,A,xx,-60,36,100.0,400.50,NaN
1,Reem,Naif,35_F,C,170.3,75.5,35,NaN,500.02,500
2,Khalid,Omar,34_M,C,155.1,56.8,34,1000.0,100.90,xx
3,Hassan,Salem,36_M,C,154.2,60.6,36,100.0,200.70,300
4,Noor,Ali,38_F,A,162.1,58.7,38,600.0,200.60,200
5,Shahad,Khalid,37_F,B,175.4,85.6,37,1500.0,200.80,300
6,Ibrahim,Ahmed,38_M,B,NaN,xx,38,NaN,1000.80,NaN
7,Osama,Hassan,35_M,B,165.1,?,35,500.0,-100.00,200
8,Ahmed,Naser,40_M,A,0,55.6,40,300.0,300.70,NaN
9,Huda,Saleh,39_M,B,160.8,57.5,39,200.0,NaN,300

# Exploratory data analysis

In [14]:
df.shape

(10, 10)

In [15]:
df.head()

,fname,lname,age_gender,section,height(cm),weight(kg),age,spend_A,spend_B,spend_C
0,Mohammed,Ali,36_M,A,xx,-60,36,100.0,400.50,NaN
1,Reem,Naif,35_F,C,170.3,75.5,35,NaN,500.02,500
2,Khalid,Omar,34_M,C,155.1,56.8,34,1000.0,100.90,xx
3,Hassan,Salem,36_M,C,154.2,60.6,36,100.0,200.70,300
4,Noor,Ali,38_F,A,162.1,58.7,38,600.0,200.60,200

In [16]:
df.tail()

,fname,lname,age_gender,section,height(cm),weight(kg),age,spend_A,spend_B,spend_C
5,Shahad,Khalid,37_F,B,175.4,85.6,37,1500.0,200.8,300
6,Ibrahim,Ahmed,38_M,B,NaN,xx,38,NaN,1000.8,NaN
7,Osama,Hassan,35_M,B,165.1,?,35,500.0,-100.0,200
8,Ahmed,Naser,40_M,A,0,55.6,40,300.0,300.7,NaN
9,Huda,Saleh,39_M,B,160.8,57.5,39,200.0,NaN,300

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   fname       10 non-null     object
 1   lname       10 non-null     object
 2   age_gender  10 non-null     object
 3   section     10 non-null     object
 4   height(cm)  9 non-null      object
 5   weight(kg)  10 non-null     object
 6   age         10 non-null     int64
 7   spend_A     8 non-null      float64
 8   spend_B     9 non-null      float64
 9   spend_C     7 non-null      object
dtypes: float64(2), int64(1), object(7)
memory usage: 928.0+ bytes

In [18]:
df

,fname,lname,age_gender,section,height(cm),weight(kg),age,spend_A,spend_B,spend_C
0,Mohammed,Ali,36_M,A,xx,-60,36,100.0,400.50,NaN
1,Reem,Naif,35_F,C,170.3,75.5,35,NaN,500.02,500
2,Khalid,Omar,34_M,C,155.1,56.8,34,1000.0,100.90,xx
3,Hassan,Salem,36_M,C,154.2,60.6,36,100.0,200.70,300
4,Noor,Ali,38_F,A,162.1,58.7,38,600.0,200.60,200
5,Shahad,Khalid,37_F,B,175.4,85.6,37,1500.0,200.80,300
6,Ibrahim,Ahmed,38_M,B,NaN,xx,38,NaN,1000.80,NaN
7,Osama,Hassan,35_M,B,165.1,?,35,500.0,-100.00,200
8,Ahmed,Naser,40_M,A,0,55.6,40,300.0,300.70,NaN
9,Huda,Saleh,39_M,B,160.8,57.5,39,200.0,NaN,300

In [19]:
df.dtypes

fname          object
lname          object
age_gender     object
section        object
height(cm)     object
weight(kg)     object
age             int64
spend_A       float64
spend_B       float64
spend_C        object
dtype: object

# Handling invalid values

In [20]:
df

,fname,lname,age_gender,section,height(cm),weight(kg),age,spend_A,spend_B,spend_C
0,Mohammed,Ali,36_M,A,xx,-60,36,100.0,400.50,NaN
1,Reem,Naif,35_F,C,170.3,75.5,35,NaN,500.02,500
2,Khalid,Omar,34_M,C,155.1,56.8,34,1000.0,100.90,xx
3,Hassan,Salem,36_M,C,154.2,60.6,36,100.0,200.70,300
4,Noor,Ali,38_F,A,162.1,58.7,38,600.0,200.60,200
5,Shahad,Khalid,37_F,B,175.4,85.6,37,1500.0,200.80,300
6,Ibrahim,Ahmed,38_M,B,NaN,xx,38,NaN,1000.80,NaN
7,Osama,Hassan,35_M,B,165.1,?,35,500.0,-100.00,200
8,Ahmed,Naser,40_M,A,0,55.6,40,300.0,300.70,NaN
9,Huda,Saleh,39_M,B,160.8,57.5,39,200.0,NaN,300

In [21]:
df['height(cm)'] = pd.to_numeric(df['height(cm)'] , errors= 'coerce')

In [22]:
df['weight(kg)'] = pd.to_numeric(df['weight(kg)'] , errors= 'coerce')

In [23]:
df['spend_C'] = pd.to_numeric(df['spend_C'] , errors= 'coerce')

In [24]:
df.dtypes

fname          object
lname          object
age_gender     object
section        object
height(cm)    float64
weight(kg)    float64
age             int64
spend_A       float64
spend_B       float64
spend_C       float64
dtype: object

In [25]:
df

,fname,lname,age_gender,section,height(cm),weight(kg),age,spend_A,spend_B,spend_C
0,Mohammed,Ali,36_M,A,NaN,-60.0,36,100.0,400.50,NaN
1,Reem,Naif,35_F,C,170.3,75.5,35,NaN,500.02,500.0
2,Khalid,Omar,34_M,C,155.1,56.8,34,1000.0,100.90,NaN
3,Hassan,Salem,36_M,C,154.2,60.6,36,100.0,200.70,300.0
4,Noor,Ali,38_F,A,162.1,58.7,38,600.0,200.60,200.0
5,Shahad,Khalid,37_F,B,175.4,85.6,37,1500.0,200.80,300.0
6,Ibrahim,Ahmed,38_M,B,NaN,NaN,38,NaN,1000.80,NaN
7,Osama,Hassan,35_M,B,165.1,NaN,35,500.0,-100.00,200.0
8,Ahmed,Naser,40_M,A,0.0,55.6,40,300.0,300.70,NaN
9,Huda,Saleh,39_M,B,160.8,57.5,39,200.0,NaN,300.0

 <h1> Split columns </h1>

In [26]:
df[['age' , 'gender']] = df.age_gender.str.split('_' , expand =True)

In [27]:
df

,fname,lname,age_gender,section,height(cm),weight(kg),age,spend_A,spend_B,spend_C,gender
0,Mohammed,Ali,36_M,A,NaN,-60.0,36,100.0,400.50,NaN,M
1,Reem,Naif,35_F,C,170.3,75.5,35,NaN,500.02,500.0,F
2,Khalid,Omar,34_M,C,155.1,56.8,34,1000.0,100.90,NaN,M
3,Hassan,Salem,36_M,C,154.2,60.6,36,100.0,200.70,300.0,M
4,Noor,Ali,38_F,A,162.1,58.7,38,600.0,200.60,200.0,F
5,Shahad,Khalid,37_F,B,175.4,85.6,37,1500.0,200.80,300.0,F
6,Ibrahim,Ahmed,38_M,B,NaN,NaN,38,NaN,1000.80,NaN,M
7,Osama,Hassan,35_M,B,165.1,NaN,35,500.0,-100.00,200.0,M
8,Ahmed,Naser,40_M,A,0.0,55.6,40,300.0,300.70,NaN,M
9,Huda,Saleh,39_M,B,160.8,57.5,39,200.0,NaN,300.0,M

In [28]:
df.drop(['age_gender'] , axis = 1 , inplace= True)

In [29]:
df

,fname,lname,section,height(cm),weight(kg),age,spend_A,spend_B,spend_C,gender
0,Mohammed,Ali,A,NaN,-60.0,36,100.0,400.50,NaN,M
1,Reem,Naif,C,170.3,75.5,35,NaN,500.02,500.0,F
2,Khalid,Omar,C,155.1,56.8,34,1000.0,100.90,NaN,M
3,Hassan,Salem,C,154.2,60.6,36,100.0,200.70,300.0,M
4,Noor,Ali,A,162.1,58.7,38,600.0,200.60,200.0,F
5,Shahad,Khalid,B,175.4,85.6,37,1500.0,200.80,300.0,F
6,Ibrahim,Ahmed,B,NaN,NaN,38,NaN,1000.80,NaN,M
7,Osama,Hassan,B,165.1,NaN,35,500.0,-100.00,200.0,M
8,Ahmed,Naser,A,0.0,55.6,40,300.0,300.70,NaN,M
9,Huda,Saleh,B,160.8,57.5,39,200.0,NaN,300.0,M

# Reordering

In [30]:
df = df[['fname', 'lname','age','gender','height(cm)','weight(kg)','spend_A','spend_B','spend_C']]

In [31]:
df

,fname,lname,age,gender,height(cm),weight(kg),spend_A,spend_B,spend_C
0,Mohammed,Ali,36,M,NaN,-60.0,100.0,400.50,NaN
1,Reem,Naif,35,F,170.3,75.5,NaN,500.02,500.0
2,Khalid,Omar,34,M,155.1,56.8,1000.0,100.90,NaN
3,Hassan,Salem,36,M,154.2,60.6,100.0,200.70,300.0
4,Noor,Ali,38,F,162.1,58.7,600.0,200.60,200.0
5,Shahad,Khalid,37,F,175.4,85.6,1500.0,200.80,300.0
6,Ibrahim,Ahmed,38,M,NaN,NaN,NaN,1000.80,NaN
7,Osama,Hassan,35,M,165.1,NaN,500.0,-100.00,200.0
8,Ahmed,Naser,40,M,0.0,55.6,300.0,300.70,NaN
9,Huda,Saleh,39,M,160.8,57.5,200.0,NaN,300.0

#  Dealing with negative numerical values

In [32]:
pd.set_option('mode.chained_assignment' , None)

In [33]:
df['weight(kg)'].replace(-60 , 60 , inplace =True )

df

In [34]:
df['spend_B'].replace(-100,100,inplace = True)

In [35]:
df

,fname,lname,age,gender,height(cm),weight(kg),spend_A,spend_B,spend_C
0,Mohammed,Ali,36,M,NaN,60.0,100.0,400.50,NaN
1,Reem,Naif,35,F,170.3,75.5,NaN,500.02,500.0
2,Khalid,Omar,34,M,155.1,56.8,1000.0,100.90,NaN
3,Hassan,Salem,36,M,154.2,60.6,100.0,200.70,300.0
4,Noor,Ali,38,F,162.1,58.7,600.0,200.60,200.0
5,Shahad,Khalid,37,F,175.4,85.6,1500.0,200.80,300.0
6,Ibrahim,Ahmed,38,M,NaN,NaN,NaN,1000.80,NaN
7,Osama,Hassan,35,M,165.1,NaN,500.0,100.00,200.0
8,Ahmed,Naser,40,M,0.0,55.6,300.0,300.70,NaN
9,Huda,Saleh,39,M,160.8,57.5,200.0,NaN,300.0

# Dealing with outliers

In [36]:
mean = df['height(cm)'].mean()

In [37]:
mean

142.875

In [38]:
df['height(cm)'].replace(0.0 , mean , inplace = True)

In [39]:
df

,fname,lname,age,gender,height(cm),weight(kg),spend_A,spend_B,spend_C
0,Mohammed,Ali,36,M,NaN,60.0,100.0,400.50,NaN
1,Reem,Naif,35,F,170.300,75.5,NaN,500.02,500.0
2,Khalid,Omar,34,M,155.100,56.8,1000.0,100.90,NaN
3,Hassan,Salem,36,M,154.200,60.6,100.0,200.70,300.0
4,Noor,Ali,38,F,162.100,58.7,600.0,200.60,200.0
5,Shahad,Khalid,37,F,175.400,85.6,1500.0,200.80,300.0
6,Ibrahim,Ahmed,38,M,NaN,NaN,NaN,1000.80,NaN
7,Osama,Hassan,35,M,165.100,NaN,500.0,100.00,200.0
8,Ahmed,Naser,40,M,142.875,55.6,300.0,300.70,NaN
9,Huda,Saleh,39,M,160.800,57.5,200.0,NaN,300.0

 # Dealing with missing numerical values

In [40]:
df.isnull().sum()

fname         0
lname         0
age           0
gender        0
height(cm)    2
weight(kg)    2
spend_A       2
spend_B       1
spend_C       4
dtype: int64

In [41]:
mean_height = df['height(cm)'].mean()
mean_weight = df['weight(kg)'].mean()
mean_spend_A = df['spend_A'].mean()
mean_spend_B = df['spend_B'].mean()
mean_spend_C = df['spend_C'].mean()

In [42]:
df['height(cm)'].fillna(mean_height , inplace = True)
df['weight(kg)'].fillna(mean_weight , inplace = True)
df['spend_A'].fillna(mean_spend_A , inplace = True)
df['spend_B'].fillna(mean_spend_B , inplace = True)
df['spend_C'].fillna(mean_spend_C , inplace = True)

In [43]:
df

,fname,lname,age,gender,height(cm),weight(kg),spend_A,spend_B,spend_C
0,Mohammed,Ali,36,M,160.734375,60.0000,100.0,400.500000,300.0
1,Reem,Naif,35,F,170.300000,75.5000,537.5,500.020000,500.0
2,Khalid,Omar,34,M,155.100000,56.8000,1000.0,100.900000,300.0
3,Hassan,Salem,36,M,154.200000,60.6000,100.0,200.700000,300.0
4,Noor,Ali,38,F,162.100000,58.7000,600.0,200.600000,200.0
5,Shahad,Khalid,37,F,175.400000,85.6000,1500.0,200.800000,300.0
6,Ibrahim,Ahmed,38,M,160.734375,63.7875,537.5,1000.800000,300.0
7,Osama,Hassan,35,M,165.100000,63.7875,500.0,100.000000,200.0
8,Ahmed,Naser,40,M,142.875000,55.6000,300.0,300.700000,300.0
9,Huda,Saleh,39,M,160.800000,57.5000,200.0,333.891111,300.0

In [44]:
df.isnull().sum()

fname         0
lname         0
age           0
gender        0
height(cm)    0
weight(kg)    0
spend_A       0
spend_B       0
spend_C       0
dtype: int64

In [45]:
name = 'final_output.csv'
df.to_csv(name)